link = "<a href=\"https://www.youtube.com/\" >YouTube</a>"
arg = '<i>%s</i>'
text = {'en':
            {'start': 'Hey, buddy! Send me a link from '+link+' and in my answer I will send you an audio track'
             ' from this video',
             'linkformat': "Sorry, but this is the wrong link. <b>Link format:</b>\n"
             "<i>https://www.youtube.com/watch?v=kJQP7kiw5Fk</i>",
             'error': 'This video is currently unavailable, try again later',
             "way1": 'Ok, I will only delete messages of the download process👌',
             "way2": "Ok, I will delete all messages except audio👌",
             "way3": "I won't delete anything👌",
             "video": "BAADAgADsAYAAqLyYEmtRIMRWSYUNwI",
             'lang': 'Choose your language',
             'way': 'Method ',
             "loading": "This may take some time...\n\n     ⏳ <i>Loading and processing audio file</i>\n"
                        "     ⏳ <i>Sending audio file</i>",
             "loadingproc": "This may take some time...\n\n     ⏳ <i>Loading and processing audio file</i> " + arg + "\n"
                        "     ⏳ <i>Sending audio file</i>",
             "loading1": "This may take some time...\n\n     ✅ <i>Loading and processing audio file</i>\n"
                         "     ⏳ <i>Sending audio file</i>",
             "loading2": "This may take some time...\n\n     ✅ <i>Loading and processing audio file</i>\n"
                         "     ✅ <i>Sending audio file</i>",
             "loadinger": "This may take some time...\n\n     ❌ <i>Loading and processing audio file</i>\n"
                          "     ❌ <i>Sending audio file</i>",
             'lang1': 'You have successfully changed your language to English, enjoyable.',
             'help': 'The bot is designed to download the videos you like from ' + link + ' directly to Telegram, '
                                                                                          'in audio'
             ' format\n\nHow to use:\n\n1. Go to the page with an interesting video on ' + link + ' .\n2.'
             ' 2. Press the «Share» button.\n3. In the opens menu select - Telegram.\n4. When Telegram opens'
             ' choose our bot. That\'s it!👌\n\nOr just insert the link into the chat and send it to the bot.\n\n'
             'Useful commands of this bot:\n/lang - Change language\n/help - Help in using the bot\n'
             '/settings - Change the way you delete information\n/start - Getting'
             ' started with bot\n\nAlso, you can use the @vid function by sending a message to the bot:\n'
             '@vid Video title\n\nContacts:\nFeedback - @Yura_ST',
             "log": 'Select the method for deleting messages:\nWay 1: Delete messages of the download process only'
             '\nWay 2: Delete all messages, including a link to the video from ' + link + ' (Default)\n'
             'Way 3: Do not delete anything',
             },
        'ru':
            {'start': 'Привет, дружище! Просто отправь мне с ссылку с '+link+' и в ответ ты получишь аудиодорожку с'
             ' этого видеоролика',
             'linkformat': "Извини но это неправильная ссылка. <b>Формат ссылки:</b>\n"
             "<i>https://www.youtube.com/watch?v=kJQP7kiw5Fk</i>",
             'error': 'На данный момент это видео недоступно, попробуйте позже',
             "way1": 'Ок, буду удалять только сообщения процесса загрузки👌',
             "way2": "Ок, буду удалять все сообщения кроме аудио👌",
             "way3": "Ок, не буду ничего удалять👌",
             'way': 'Способ ',
             "loading": "Это может занять какое-то время...\n\n     ⏳ <i>Загрузка и обработка ролика</i>\n"
                        "     ⏳ <i>Отправка аудиофайла</i>",
             "loadingproc": "Это может занять какое-то время...\n\n     ⏳ <i>Загрузка и обработка ролика</i> " + arg + "\n"
                        "     ⏳ <i>Отправка аудиофайла</i>",
             "loading1": "Это может занять какое-то время...\n\n     ✅ <i>Загрузка и обработка ролика</i>\n"
                         "     ⏳ <i>Отправка аудиофайла</i>",
             "loading2": "Это может занять какое-то время...\n\n     ✅ <i>Загрузка и обработка ролика</i>\n"
                         "     ✅ <i>Отправка аудиофайла</i>",
             "loadinger": "Это может занять какое-то время...\n\n     ❌ <i>Загрузка и обработка ролика</i>\n"
                          "     ❌ <i>Отправка аудиофайла</i>",
             "video": "BAADAgAD4QMAAlNRaEmfQyv3Nbv-YQI",
             'lang': 'Выберите удобный вам язык',
             'lang1': 'Вы успешно изменили ваш язык на русский, приятного пользования',
             'help': 'Бот предназначен для загрузки понравившихся видео с ' + link + ' прямо в Telegram, в аудио'
                                                                                     ' формате\n\n'
             'Как пользоваться:\n\n1. Зайди на страницу с интересным роликом на ' + link + '.\n2. Нажми'
             ' кнопку «Поделиться».\n3. В открывшемся меню выбери - Telegram.\n4. Когда откроется Telegram'
             ' выбери нашего бота. Вот и всё!👌\n\nИли просто вставь ссылку на ролик в чат и отправь ее боту.\n\n'
             'Полезные команды этого бота:\n/lang - Поменять язык\n/help - Помощь в использовании бота\n'
             '/settings - Изменить способ удаления информации\n/start - Начало работы с ботом\n\nТакже вы можете'
             ' использовать функцию @vid отправив сообщение боту:\n@vid Название видео\n\nКонтакты:\nОбратная связь'
                                                                                           ' - @Yura_ST',
             "log": 'Выберите способ удаления сообщений:\nСпособ 1: Удалять только сообщения процеса загрузки'
             '\nСпособ 2: Удалять '
             'все сообщения, включая ссылку на видео c '+link+' (По умолчанию)\nСпособ 3: Ничего не удалять'
             },
        'ua':
            {'start': 'Привіт друже! Просто відправ мені ссилку з '+link+' і у відповідь ти отримаєш аудіодоріжку з'
             ' цього відеоролика',
             'linkformat': "Вибач та це неправильне посилання. <b>Формат посилання:</b>\n"
             "<i>https://www.youtube.com/watch?v=kJQP7kiw5Fk</i>",
             'error': 'На даний момент це відео недоступне, спробуйте пізніше',
             "way1": 'Ок, буду видаляти тільки повідомлення процесу завантаження👌',
             "way2": "Ок, буду видаляти всі повідомлення крім аудіо👌",
             "way3": "Ок, не буду нічого видаляти👌",
             'way': 'Спосіб ',
             "video": "BAADAgAD9AMAAr8IYUmFzGZyIIGO9QI",
             'lang': 'Виберіть зручну вам мову',
             'lang1': 'Ви успішно змінили мову на українську, приємного користування',
             "loading": "Це може зайняти якийсь час...\n\n     ⏳ <i>Завантаження та обробка ролика</i>\n"
                        "     ⏳ <i>Відправка аудіофайлу</i>",
             "loadingproc": "Це може зайняти якийсь час...\n\n     ⏳ <i>Завантаження та обробка ролика</i> " + arg + "\n"
                        "     ⏳ <i>Відправка аудіофайлу</i>",
             "loading1": "Це може зайняти якийсь час...\n\n     ✅ <i>Завантаження та обробка ролика</i>\n     "
                         "⏳ <i>Відправка аудіофайлу</i>",
             "loading2": "Це може зайняти якийсь час...\n\n     ✅ <i>Завантаження та обробка ролика</i>\n"
                         "     ✅ <i>Відправка аудіофайлу</i>",
             "loadinger": "Це може зайняти якийсь час...\n\n     ❌ <i>Завантаження та обробка ролика</i>\n"
                          "     ❌ <i>Відправка аудіофайлу</i>",
             'help': 'Бот призначений для завантаження вподобаних відео з ' + link + ' прямо в Telegram, в аудіо'
                                                                                     ' форматі\n\n'
             'Як користуватися:\n\n1. Зайди на сторінку з цікавим роликом на ' + link + '.\n2. Натисни'
             ' кнопку «Поділитися».\n3. У відкритому меню вибери - Telegram.\n4. Коли відкриється Telegram'
             ' вибери нашого бота. Ось і все!👌\n\nАбо просто встав посилання на ролик в чат і відправ її боту.\n\n'
             'Корисні команди цього бота:\n/lang - Поміняти мову\n/help - Допомога в використанні бота\n'
             '/settings - Змінити спосіб видалення інформації\n/start - Початок роботи з ботом\n\nТакож ви можете'
             ' використовувати функцію @vid відправивши повідомлення боту:\n@vid Назва відео\n\nКонтакти:\nЗворотній'
             ' зв\'язок - @Yura_ST',
             "log": 'Виберіть спосіб видалення повідомлень: \nСпосіб 1: Видаляти тільки повідомлення процеса'
                    ' завантаження'
                '\nСпосіб 2: Видаляти всі повідомлення, включаючи посилання на відео з '+link + ' (За замовчуванням)\n'
                'Спосіб 3: Нічого не видаляти',
             }}
comands = {'/start': True,
           '/help': True,
           '/settings': True,
           '/lang': True}